# Agenda: Day 2

1. Recap and Q&A
2. Dtypes and `NaN`
3. Data frames (2D data)
    - Creating data frames
    - Retrieving rows
    - Retrieving columns
    - Naming the index and the columns
4. Adding and removing data
5. Useful methods and attributes
6. Boolean indexes
7. Querying with `.loc`
    - Row selectors
    - Column selectors
    - Assigning via `.loc`
8. Reading CSV data

# Recap

- Pandas is for reading, writing, manipulating, cleaning, and analyzing data
- Last time, we talked about the *Series*
- A series contains a bunch of values, all of the same type
- Retrieve from a series using `.loc` (by index) or `.iloc` (by position)
- We can set the index either when we create the series or assign a new value
- We can retrieve using a mask index via a boolean series
- Most operations performed on two series happen via the index
- If we have a series and a scalar value, the operation is "broadcast" to every element of the series

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
s = Series([10, 20, 30, 40, 45, 50, 60, 70])

In [3]:
s

0    10
1    20
2    30
3    40
4    45
5    50
6    60
7    70
dtype: int64

In [4]:
s.loc[4]

45

In [5]:
s.loc[[4, 6]]   # fancy indexing

4    45
6    60
dtype: int64

In [6]:
s = Series([10, 20, 30, 40, 45, 50, 60, 70],
          index=list('abcdefgh'))

In [7]:
s

a    10
b    20
c    30
d    40
e    45
f    50
g    60
h    70
dtype: int64

In [8]:
s.loc['d']

40

In [9]:
s.loc[['d', 'f']]

d    40
f    50
dtype: int64

In [10]:
# we can retrieve via the position using .iloc
s.iloc[4]

45

In [11]:
s.iloc[[4, 6]]

e    45
g    60
dtype: int64

In [12]:
s + s    # two series, thus operations are performed by the index

a     20
b     40
c     60
d     80
e     90
f    100
g    120
h    140
dtype: int64

In [13]:
# broadcasting

s + 4

a    14
b    24
c    34
d    44
e    49
f    54
g    64
h    74
dtype: int64

In [14]:
# we can run comparison operations via broadcast, and get a True/False value for each index

s < 50

a     True
b     True
c     True
d     True
e     True
f    False
g    False
h    False
dtype: bool

In [15]:
# if we have a boolean series, we can apply it with .loc
# this returns only those elements of the series for which our booleans are True

s.loc[s<50]

a    10
b    20
c    30
d    40
e    45
dtype: int64

In [16]:
(s<50).value_counts()

True     5
False    3
dtype: int64

In [17]:
s.describe()

count     8.000000
mean     40.625000
std      20.077973
min      10.000000
25%      27.500000
50%      42.500000
75%      52.500000
max      70.000000
dtype: float64

# Dtypes

If you're a Python programmer, then you might have wondered what the difference is between a "list" and an "array."  In the case of an array, (a) the length is known when it's created and (b) all of the elements are of the same type.

Python lists don't have either of these restrictions! 

Pandas series can be changed in length, so they aren't arrays, either. But they are more similar to arrays, in that all of the elements must be of the same type.

In [18]:
s = Series([10, 20, 30, 40, 50])
s

0    10
1    20
2    30
3    40
4    50
dtype: int64

# `dtype`

Every series has a `dtype`, describing what kind of data is in the series. The `dtype` is typically *not* a Python type, but is a special type based on the NumPy library, which is based in the C language.

In Python, we have integers. But in C, we have integers of different sizes.  The `dtype` allows us to specify how mnay bits we want to give to each integer. If we don't have integer data, then we have to specify that, too.

In [19]:
# 64 bits == 8 bytes

In [20]:
s = Series([10, 20, 30.5, 40, 50])   # notice, one number is *not* an integer
s

0    10.0
1    20.0
2    30.5
3    40.0
4    50.0
dtype: float64

# What `dtypes` exist? How can I set it?

Dtypes are all defined in `numpy`, which you can import as 

    import numpy as np
    
Then you can use the following types:

- Integers (ints)
    - `np.int8`
    - `np.int16`
    - `np.int32`
    - `np.int64`  (default if you give integer data)
- Floats 
    - `np.float16`
    - `np.float32`
    - `np.float64` (default if you give float data)
    - `np.float128`
- Unsigned ints
    - `np.uint8`
    - `np.uint16`
    - `np.uint32`
    - `np.uint64`
- `object` (Python objects -- default if you have strings)

In [21]:
# when I create a new series, I can tell Pandas what dtypes to use

s = Series([10, 20, 30, 40, 50])
s.dtype  # we can get the dtype with this attribute

dtype('int64')

In [22]:
s = Series([10, 20, 30, 40, 50], 
          dtype=np.float128)

s.dtype  # we can get the dtype with this attribute

dtype('float128')

In [23]:
s

0    10.0
1    20.0
2    30.0
3    40.0
4    50.0
dtype: float128

In [24]:
s.loc[2] = 345   # set a value in our series

In [25]:
s

0     10.0
1     20.0
2    345.0
3     40.0
4     50.0
dtype: float128

In [26]:
# what happens if we assign a value that doesn't match the dtype?

s = Series([10, 20, 30, 40, 50])   # dtype will be the default, np.int64
s

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [27]:
s.loc[2] = 12.34

In [28]:
s

0    10.00
1    20.00
2    12.34
3    40.00
4    50.00
dtype: float64

In [29]:
# how can I change a series from one dtype to another?
# you *cannot* assign to the dtype attribute

s.dtype = np.int64

AttributeError: property 'dtype' of 'Series' object has no setter

In [30]:
# you can use the .astype method to get a new series back,
# based on your current series, with a new type

s.astype(np.int64)  # anything after a decimal point was lost

0    10
1    20
2    12
3    40
4    50
dtype: int64

In [31]:
# if I want to "convert" a series from float to int,
# run .astype, and assign the result back to the original series

s = s.astype(np.int64)

In [32]:
s

0    10
1    20
2    12
3    40
4    50
dtype: int64

In [33]:
s = Series('10 20 30 40 50'.split())
s

0    10
1    20
2    30
3    40
4    50
dtype: object

In [34]:
s + s   # what happens when I add this series to itself?

0    1010
1    2020
2    3030
3    4040
4    5050
dtype: object

In [35]:
# if I want to turn this series into a bunch of integers, I can use astype

# here, I replaced the original (string/object) version of s with 
# an integer version, assigning it back to the same variable

s = s.astype(np.int64)
s

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [36]:
s + s

0     20
1     40
2     60
3     80
4    100
dtype: int64

In [37]:
x = 5

x + x

10

In [38]:
s = Series([10, 20, 30, 40, 50])
s

0    10
1    20
2    30
3    40
4    50
dtype: int64

# How much memory does this series take up?

5 elements * 8 bytes = 40 bytes

In [40]:
s.memory_usage()  # there is some overhead for the series object

172

Since this series only contains small numbers, maybe I can/should use smaller integers.

How much memory would it take if I use 8-bit integers?

5 elements * 1 byte = 5 bytes

In [41]:
s = Series([10, 20, 30, 40, 50], dtype=np.int8)
s

0    10
1    20
2    30
3    40
4    50
dtype: int8

In [42]:
s.memory_usage()

137

In [43]:
172 - 137

35

# What's wrong with using `int8`?

Nothing, if you want to stay with small numbers...but if they get big, bad news!

In [44]:
s

0    10
1    20
2    30
3    40
4    50
dtype: int8

In [45]:
s * 10

0    100
1    -56
2     44
3   -112
4    -12
dtype: int8

In [46]:
# 8 bits gives us 256 (2 ** 8)
# since our integers are signed, that gives us from -128 to 127
# anything outside of that range will be "wrapped around"

# if your dtype is too small, you will LOSE DATA and Pandas won't warn you!

In [47]:
s

0    10
1    20
2    30
3    40
4    50
dtype: int8

In [48]:
s.loc[2] = 99999

In [49]:
s

0       10
1       20
2    99999
3       40
4       50
dtype: int32

# Why not always use `np.int64`? 

Answer: you'll use tons of memory unnecessarily.

Consider some data with 10m data points.

10m * 8 bytes = 80 MB
10m * 1 byte =  10 MB

Consider some data with 10b data points.

10b * 8 bytes = 80 GB
10b * 1 bytes = 10 GB

Rule of thumb: Use the smallest dtype you can, without losing data -- with your current data, and with the manipulations/calculations you'll want to do later on.

# Exercise: Strings to numbers

1. Define a series whose values are digits, but in strings. (That is, the series should contain the strings `'10'`, `'20'`, `'30'`, etc. You can use whatever numbers you want.  The `dtype` for this series should be `object`, which generally means strings.
2. Calculate the mean of these numbers.

In [50]:
s = Series(['10', '20', '30', '40', '50'])
s

0    10
1    20
2    30
3    40
4    50
dtype: object

In [51]:
# what happens if I call the .mean() method on this?

s.mean()

204060810.0

In [52]:
s.sum()

'1020304050'

In [55]:
# do it on the fly, without changing s's dtype

s.astype(np.int8).mean()

30.0

In [56]:
s = s.astype(np.int8)    # replace the original series with an int series

s.mean()                 # calculate the mean on that

30.0

In [57]:
s

0    10
1    20
2    30
3    40
4    50
dtype: int8

# Special `dtype` -- `NaN` ("not a number")

Very often, when we're working with data, there will be *missing* data. It might be missing because our sensors failed. Or a computer wasn't connected to the network. Or someone didn't answer a survey question. 

Missing data is a fact of life.

The way that we represent missing data in Pandas is with `NaN` (sometimes written as `nan`), meaning "not a number." This is actually a floating-point value! It's used to represent missing data.  The `pd.NA` value is also for missing data, and you will see it in some cases, but it's still new and relatively unused.

In [59]:
# what happens if we have NaN?

from numpy import nan

s = Series([10, 20, np.nan, 30, 40])

In [61]:
s  # the dtype is float64, because NaN is a float, and that forces all of them to be floats

0    10.0
1    20.0
2     NaN
3    30.0
4    40.0
dtype: float64

In [62]:
s.mean()   # the NaN value will be ignored!

25.0

In [63]:
s.count()   # counts non-NaN values

4

In [64]:
s.loc[0] = np.nan
s

0     NaN
1    20.0
2     NaN
3    30.0
4    40.0
dtype: float64

In [66]:
np.NaN

nan

In [68]:
from numpy import NaN

In [69]:
s

0     NaN
1    20.0
2     NaN
3    30.0
4    40.0
dtype: float64

In [70]:
# how can I remove the NaN values?

# option 1: actually remove them, getting a new series back without the NaNs
s.dropna()

1    20.0
3    30.0
4    40.0
dtype: float64

In [71]:
# we haven't changed s! To do that, we need to assign the result of s.dropna() to s
s

0     NaN
1    20.0
2     NaN
3    30.0
4    40.0
dtype: float64

In [72]:
# option 2: replace the NaN values with another value
# the fillna method does that for us

s.fillna(999)

0    999.0
1     20.0
2    999.0
3     30.0
4     40.0
dtype: float64

In [73]:
# this didn't change s!
s

0     NaN
1    20.0
2     NaN
3    30.0
4    40.0
dtype: float64

In [74]:
# a common value to use with fillna is the mean of the series!
# in other words: We'll replace NaN with the mean, thus keeping the mean identical 

s.fillna(s.mean())

0    30.0
1    20.0
2    30.0
3    30.0
4    40.0
dtype: float64

In [75]:
s.mean()

30.0

In [76]:
# let's replace NaN with s's mean, then assign that back to s

s = s.fillna(s.mean())

In [77]:
s

0    30.0
1    20.0
2    30.0
3    30.0
4    40.0
dtype: float64

In [78]:
s = Series([10, 20, np.nan, 30, 40])
s

0    10.0
1    20.0
2     NaN
3    30.0
4    40.0
dtype: float64

In [79]:
s.interpolate()

0    10.0
1    20.0
2    25.0
3    30.0
4    40.0
dtype: float64

# Exercise: Missing temperatures

1. Define a series of 10 integers, with the high temperatures expected in your city in the next 10 days.  Make the index the names of the days.
2. Calculate desciptive statistics for these values.
3. Set three of the days' temperatures to be `NaN`.
4. Calculate descriptive statistics again; have they changed a lot?
5. Replace the `NaN` values with the mean of the remaining values. Have they changed much from the original values?

In [80]:
s = Series([15, 22, 23, 18, 14, 17, 19, 18, 19, 18],
          index='Wed Thu Fri Sat Sun Mon Tue Wed Thu Fri'.split())

In [81]:
s

Wed    15
Thu    22
Fri    23
Sat    18
Sun    14
Mon    17
Tue    19
Wed    18
Thu    19
Fri    18
dtype: int64

In [82]:
s.describe()

count    10.000000
mean     18.300000
std       2.750757
min      14.000000
25%      17.250000
50%      18.000000
75%      19.000000
max      23.000000
dtype: float64

In [83]:
s.loc['Sat'] = NaN
s.loc['Sun'] = NaN
s.iloc[-1] = NaN     # use iloc to avoid ambiguity and setting two elements

In [84]:
s

Wed    15.0
Thu    22.0
Fri    23.0
Sat     NaN
Sun     NaN
Mon    17.0
Tue    19.0
Wed    18.0
Thu    19.0
Fri     NaN
dtype: float64

In [85]:
s.describe()

count     7.000000
mean     19.000000
std       2.768875
min      15.000000
25%      17.500000
50%      19.000000
75%      20.500000
max      23.000000
dtype: float64

In [86]:
# now let's replace our NaN values with the mean

s.fillna(s.mean())

Wed    15.0
Thu    22.0
Fri    23.0
Sat    19.0
Sun    19.0
Mon    17.0
Tue    19.0
Wed    18.0
Thu    19.0
Fri    19.0
dtype: float64

In [87]:
# without assigning back to s, I can still get descriptive statistics for s
s.fillna(s.mean()).describe()

count    10.000000
mean     19.000000
std       2.260777
min      15.000000
25%      18.250000
50%      19.000000
75%      19.000000
max      23.000000
dtype: float64

In [88]:
s.interpolate().describe()

count    10.000000
mean     19.200000
std       2.347576
min      15.000000
25%      18.250000
50%      19.000000
75%      20.500000
max      23.000000
dtype: float64

In [89]:
s.interpolate()

Wed    15.0
Thu    22.0
Fri    23.0
Sat    21.0
Sun    19.0
Mon    17.0
Tue    19.0
Wed    18.0
Thu    19.0
Fri    19.0
dtype: float64

# Next up

1. Data frames
    - Creating
    - Retrieving from
2. Adding/removing data
3. Methods to use on our data frame

# The `interpolate` method

The simple way to get rid of `NaN` data is to remove all of those values.

A more sophisticated way is to replace `NaN` with reasonable guesses as to what the values could/should be.

One possibility is to replace all `NaN` values with the same value, namely the mean of all of the values in the series. That's what happens when you say `s.fillna(s.mean())`.  We calculate the mean once, and use it to replace all `NaN`s we found.

Another possibility, though, is to perform a more localized calculation of the mean. If index 4 contains 10, index 5 contains `NaN`, and index 6 contains 30, we can reasonably guess that index 5 should contain 20, the mean of 10 and 30.  That's what the `interpolate` method does -- it replaces each `NaN` with the mean of the two elements around it.

If there are two `NaN` values in a row, then it's smart enough to figure out the distance between the two real values, and then "step up" or "step down" on each replacement.

# Data frames

Each data frame is like an Excel spreadsheet, with rows and columns. This is what everyone wants to use Pandas for.

You can think of a data frame as as collection of series objects, with each series being a column in the data frame.

Thinking of it this way is very helpful when moving from series to data frames.

The easiest way to create a data frame is to pass Pandas a list of lists or a 2-dimensional NumPy array.

In [90]:
from pandas import Series, DataFrame

# if we pass a list of lists, each inner list is one *row*
# and the length of each inner list must be identical

df = DataFrame([[10, 20, 30, 40],
                [50, 60, 70, 80],
                [90, 100, 110, 120]])

df

    0    1    2    3
0  10   20   30   40
1  50   60   70   80
2  90  100  110  120

In [91]:
# how can I retrieve a row?
# use .loc or .iloc, just as with a series 

df.loc[1]    # I want all of the values in row index 1... which will be returned as a series

0    50
1    60
2    70
3    80
Name: 1, dtype: int64

In [92]:
# what if I want rows at index 0 and 2?

df.loc[[0, 2]]  # fancy indexing

    0    1    2    3
0  10   20   30   40
2  90  100  110  120

In [93]:
df.iloc[[0, 2]]

    0    1    2    3
0  10   20   30   40
2  90  100  110  120

In [95]:
# what if I want to retrieve columns?
# then I use []

df[1]  # column 1

0     20
1     60
2    100
Name: 1, dtype: int64

In [96]:
df[[1, 3]]

     1    3
0   20   40
1   60   80
2  100  120

In [97]:
# you almost never want to have columns with numbers
# often (not always), you'll want to name your index, too

# we can do this at creation time by passing index= and columns=,
# just like when we created our series

df = DataFrame([[10, 20, 30, 40],
                [50, 60, 70, 80],
                [90, 100, 110, 120]],
              index=list('xyz'),      # 3 rows
              columns=list('abcd'))   # 4 columns

df

    a    b    c    d
x  10   20   30   40
y  50   60   70   80
z  90  100  110  120

In [98]:
# retrieve rows with .loc!

df.loc['x']

a    10
b    20
c    30
d    40
Name: x, dtype: int64

In [99]:
df.loc[['x', 'z']]

    a    b    c    d
x  10   20   30   40
z  90  100  110  120

In [100]:
# what if I try to retrieve a row with [], and not .loc?
df['x']

KeyError: 'x'

In [101]:
df

    a    b    c    d
x  10   20   30   40
y  50   60   70   80
z  90  100  110  120

In [102]:
# to retrieve columns, just use []

df['b']

x     20
y     60
z    100
Name: b, dtype: int64

In [103]:
df[['b', 'd']]

     b    d
x   20   40
y   60   80
z  100  120

# Retrieving from a data frame

- Get a row with `.loc` (using the index)
- Get a row with `.iloc` (using the position)
- Get a column with `[]` (using the column name)

If you get one row/column back, you'll get a new series.

If you get more than one row/column back, you'll get a new data frame.

You can then run whatever series methods you want on those values.

In [104]:
df['b']  # column b

x     20
y     60
z    100
Name: b, dtype: int64

In [105]:
df['b'].mean()

60.0

# Exercise: Grocery store

1. Define a data frame in which each row represents a product at a store. The columns will be the name of the item (a string) and the price of the item (an integer).
2. Retrieve all of the information for one product (via the index).
3. Get descriptive statistics for the prices of all your products.

In [106]:
df = DataFrame([['apple', 1],
                ['banana', 2],
                ['cucumber', 3],
                ['dill', 4]])
df

          0  1
0     apple  1
1    banana  2
2  cucumber  3
3      dill  4

In [108]:
df = DataFrame([['apple', 1],
                ['banana', 2],
                ['cucumber', 3],
                ['dill', 4]],
              columns=['product', 'price'])   # name each of the columns
df

    product  price
0     apple      1
1    banana      2
2  cucumber      3
3      dill      4

In [109]:
df['product']

0       apple
1      banana
2    cucumber
3        dill
Name: product, dtype: object

In [110]:
df['price']

0    1
1    2
2    3
3    4
Name: price, dtype: int64

In [111]:
df.loc[0]

product    apple
price          1
Name: 0, dtype: object

In [112]:
df.loc[2]

product    cucumber
price             3
Name: 2, dtype: object

In [113]:
df['price']

0    1
1    2
2    3
3    4
Name: price, dtype: int64

In [114]:
# get descriptive statistics for all prices
df['price'].describe()

count    4.000000
mean     2.500000
std      1.290994
min      1.000000
25%      1.750000
50%      2.500000
75%      3.250000
max      4.000000
Name: price, dtype: float64

In [115]:
df

    product  price
0     apple      1
1    banana      2
2  cucumber      3
3      dill      4

# Adding and removing data

1. How can I add a column to the data frame?

Answer: Assign to that column

2. How can I replace a column in the data frame?

Answer: Assign to that column

In [116]:
# I'm assigning to a column that doesn't yet exist
# this will create that column in the data frame
# note that the number of values *must* match the number of rows in the data frame

df['instock'] = [10, 5, 7, 20]

In [117]:
df

    product  price  instock
0     apple      1       10
1    banana      2        5
2  cucumber      3        7
3      dill      4       20

In [118]:
# what if I want to update that column?

df['instock'] = [15, 7, 9, 14]
df

    product  price  instock
0     apple      1       15
1    banana      2        7
2  cucumber      3        9
3      dill      4       14

In [119]:
# how I can I add a new row?
# answer: Just assign to it, via .loc

df.loc[4] = ['endive', 5, 6]
df

    product  price  instock
0     apple      1       15
1    banana      2        7
2  cucumber      3        9
3      dill      4       14
4    endive      5        6

In [120]:
# what is the value of all of the items in our store?
# we can calculate that as price * instock

df['price']

0    1
1    2
2    3
3    4
4    5
Name: price, dtype: int64

In [121]:
df['instock']

0    15
1     7
2     9
3    14
4     6
Name: instock, dtype: int64

In [122]:
# if I perform a mathematical operation on two series that have the same index,
# I'll get a new series back with that same index, and with the operation performed
# for each index

df['price'] * df['instock']

0    15
1    14
2    27
3    56
4    30
dtype: int64

In [123]:
# we'll create a new column, "value", whose values are the product of price * instock
df['value'] = df['price'] * df['instock']

In [124]:
df

    product  price  instock  value
0     apple      1       15     15
1    banana      2        7     14
2  cucumber      3        9     27
3      dill      4       14     56
4    endive      5        6     30

# Removing data

This is a bit trickier, but still (definitely) possible.

To remove a row, use the `df.drop` method:

    df.drop(4)    # you could also say df.drop(4, axis='rows')
    
This returns a new data frame, identical to `df`, but without index 4.

To remove a column, we'll also use `df.drop`, but we'll have to tell Pandas to drop a column:

    df.drop('value', axis='columns')

In [125]:
df.drop('value', axis='columns')

    product  price  instock
0     apple      1       15
1    banana      2        7
2  cucumber      3        9
3      dill      4       14
4    endive      5        6

In [126]:
# generally speaking, wherever Pandas accepts a single column name, we can
# provide a list of column names

# so I can drop multiple columns by passing a list of columns

df.drop(['instock', 'value'], axis='columns')

    product  price
0     apple      1
1    banana      2
2  cucumber      3
3      dill      4
4    endive      5

# Exercise: Weather data calculations

1. Define a data frame with 10 rows.
2. The index should be day names from the next 10 days.
3. The columns should contain, from the next 10 days:
    - High temps
    - Low temps
4. Define a new column, `diff`, containing the difference between high and low temps in your data frame

In the end, we'll have a data frame with 10 rows and 3 columns.

In [129]:
df = DataFrame([[11, 15],
                [10, 22],
                [14, 23],
                [12, 18],
                [12, 14],
                [11, 17],
                [12, 19],
                [12, 18],
                 [12, 19],
                [10, 18]],
              columns=['low', 'high'],
              index='Wed Thu Fri Sat Sun Mon Tue Wed Thu Fri'.split())
df

     low  high
Wed   11    15
Thu   10    22
Fri   14    23
Sat   12    18
Sun   12    14
Mon   11    17
Tue   12    19
Wed   12    18
Thu   12    19
Fri   10    18

In [130]:
df['high'] - df['low']

Wed     4
Thu    12
Fri     9
Sat     6
Sun     2
Mon     6
Tue     7
Wed     6
Thu     7
Fri     8
dtype: int64

In [131]:
# add this new column
df['diff'] = df['high'] - df['low']

In [132]:
df

     low  high  diff
Wed   11    15     4
Thu   10    22    12
Fri   14    23     9
Sat   12    18     6
Sun   12    14     2
Mon   11    17     6
Tue   12    19     7
Wed   12    18     6
Thu   12    19     7
Fri   10    18     8

In [133]:
# get descriptive statistics for our diff column

df['diff'].describe()

count    10.000000
mean      6.700000
std       2.710064
min       2.000000
25%       6.000000
50%       6.500000
75%       7.750000
max      12.000000
Name: diff, dtype: float64

In [134]:
# if I want to remove the "diff" column after using it, I can:

df = df.drop('diff', axis='columns')

In [135]:
df

     low  high
Wed   11    15
Thu   10    22
Fri   14    23
Sat   12    18
Sun   12    14
Mon   11    17
Tue   12    19
Wed   12    18
Thu   12    19
Fri   10    18

# Next up

1. Useful methods and attributes
2. Querying with boolean indexes

# When do we use `()`, and when do we use `[]`?

In a nutshell:

Round parentheses, `()`, are used:
- When we're calling a function or method (e.g., `len('abc')`, or `s.describe()`)
- For math grouping
- Creating a new object, e.g., `int()` or `DataFrame()`

Square brackets, `[]`, are used:
- For retriving an element from a larger collection (e.g., `s[3]`)
- For creating a list

When I create a data frame with a list of lists, it looks like this:

```python
df = DataFrame(                 # calling DataFrame with ()
                [               # opening the outer list
                [10, 20, 30],    # first inner list -- use []
                [40, 50, 60]     # second inner list -- use []
                ]               # closing the outer list
              )                 # close to the call to DataFrame
```

For more info: https://lerner.co.il/2018/06/08/python-parentheses-primer/

# Useful methods and attributes

In just about every case, methods that we used on a series will also work on a data frame. But instead of getting a single value back, we'll get one value for each *column*. The index (rows) of the returned value will be the column names.

In [136]:
df

     low  high
Wed   11    15
Thu   10    22
Fri   14    23
Sat   12    18
Sun   12    14
Mon   11    17
Tue   12    19
Wed   12    18
Thu   12    19
Fri   10    18

In [137]:
# I can run describe on the low column
df['low'].describe()

count    10.000000
mean     11.600000
std       1.173788
min      10.000000
25%      11.000000
50%      12.000000
75%      12.000000
max      14.000000
Name: low, dtype: float64

In [138]:
# I can run describe on the high column 
df['high'].describe()

count    10.000000
mean     18.300000
std       2.750757
min      14.000000
25%      17.250000
50%      18.000000
75%      19.000000
max      23.000000
Name: high, dtype: float64

In [139]:
# I can run describe on the entire data frame

df.describe()

             low       high
count  10.000000  10.000000
mean   11.600000  18.300000
std     1.173788   2.750757
min    10.000000  14.000000
25%    11.000000  17.250000
50%    12.000000  18.000000
75%    12.000000  19.000000
max    14.000000  23.000000

In [140]:
df['low'].dtype

dtype('int64')

In [141]:
df['high'].dtype

dtype('int64')

In [142]:
df.dtypes    # attribute, not a method, and it's plural

low     int64
high    int64
dtype: object

In [144]:
df.mean()    # get the mean of each column -- column names are the index

low     11.6
high    18.3
dtype: float64

In [145]:
df.std()

low     1.173788
high    2.750757
dtype: float64

In [146]:
df.quantile(0.7)

low     12.0
high    19.0
Name: 0.7, dtype: float64

In [147]:
df.value_counts()

low  high
12   18      2
     19      2
10   18      1
     22      1
11   15      1
     17      1
12   14      1
14   23      1
dtype: int64

In [148]:
df.mean()

low     11.6
high    18.3
dtype: float64

In [149]:
# another useful method is .info()
# this tells us about the data frame object itself, not so much the data it contains

df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, Wed to Fri
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   low     10 non-null     int64
 1   high    10 non-null     int64
dtypes: int64(2)
memory usage: 540.0+ bytes

# Applying methods to rows

When we invoke an aggregation method on a data frame, the assumption is that we'll want to do so on each column. But sometimes, we'll want to run it on each row. 

How can we do that?

In [150]:
# option 1: transpose the data frame, making rows->columns and columns->rows, and then invoke our method

df.mean()

low     11.6
high    18.3
dtype: float64

In [151]:
df.T

      Wed  Thu  Fri  Sat  Sun  Mon  Tue  Wed  Thu  Fri
low    11   10   14   12   12   11   12   12   12   10
high   15   22   23   18   14   17   19   18   19   18

In [152]:
df.T.mean()

Wed    13.0
Thu    16.0
Fri    18.5
Sat    15.0
Sun    13.0
Mon    14.0
Tue    15.5
Wed    15.0
Thu    15.5
Fri    14.0
dtype: float64

In [153]:
# option 2: pass axis='columns' to our method, and it does the same thing

df.mean(axis='columns')

Wed    13.0
Thu    16.0
Fri    18.5
Sat    15.0
Sun    13.0
Mon    14.0
Tue    15.5
Wed    15.0
Thu    15.5
Fri    14.0
dtype: float64

# Exercise: Family data

1. Create a data frame describing your family (or any family, if you want!).
2. Three columns: name (string), age (int), shoe size (int)
3. Have 4-5 rows with different people
4. Get descriptive statistics for the age column
5. Get descriptive statistics for age + shoe size
6. Run value_counts on everything

In [155]:
df = DataFrame([
    ['Reuven', 52, 46],
    ['Atara', 22, 40],
    ['Shikma', 20, 40],
    ['Amotz', 17, 44]
    ],
  columns='name age shoesize'.split())
df

     name  age  shoesize
0  Reuven   52        46
1   Atara   22        40
2  Shikma   20        40
3   Amotz   17        44

In [156]:
df['age'].describe()

count     4.000000
mean     27.750000
std      16.296728
min      17.000000
25%      19.250000
50%      21.000000
75%      29.500000
max      52.000000
Name: age, dtype: float64

In [157]:
df['shoesize'].describe()

count     4.0
mean     42.5
std       3.0
min      40.0
25%      40.0
50%      42.0
75%      44.5
max      46.0
Name: shoesize, dtype: float64

In [158]:
# run describe on the entire data frame...
df.describe()

             age  shoesize
count   4.000000       4.0
mean   27.750000      42.5
std    16.296728       3.0
min    17.000000      40.0
25%    19.250000      40.0
50%    21.000000      42.0
75%    29.500000      44.5
max    52.000000      46.0

In [159]:
df.sum()

name        ReuvenAtaraShikmaAmotz
age                            111
shoesize                       170
dtype: object

In [160]:
df.mean()

/var/folders/rr/0mnyyv811fs5vyp22gf4fxk00000gn/T/ipykernel_30401/3698961737.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

age         27.75
shoesize    42.50
dtype: float64

In [161]:
df.mean(numeric_only=True)

age         27.75
shoesize    42.50
dtype: float64

In [162]:
df.sum(numeric_only=True)

age         111
shoesize    170
dtype: int64

In [163]:
df.value_counts()

name    age  shoesize
Amotz   17   44          1
Atara   22   40          1
Reuven  52   46          1
Shikma  20   40          1
dtype: int64

In [165]:
df[['age', 'shoesize']].value_counts()

age  shoesize
17   44          1
20   40          1
22   40          1
52   46          1
dtype: int64

In [166]:
df['shoesize'].value_counts()

40    2
46    1
44    1
Name: shoesize, dtype: int64

In [167]:
df

     name  age  shoesize
0  Reuven   52        46
1   Atara   22        40
2  Shikma   20        40
3   Amotz   17        44

# Setting the index from a column

Wouldn't it make sense, in this example, for the names to be our index?

The answer: Yes, but what can I do about it if I've already created my data frame?

I can run the `set_index` method. I pass the name of a column, and the current index is replaced with the values in the named column.

In [169]:
df.set_index('name')   # this returns a new data frame with "name" as the index

        age  shoesize
name
Reuven   52        46
Atara    22        40
Shikma   20        40
Amotz    17        44

In [170]:
# want to change df? Assign back to it

df = df.set_index('name')

In [171]:
df

        age  shoesize
name
Reuven   52        46
Atara    22        40
Shikma   20        40
Amotz    17        44

In [172]:
df.loc['Reuven']

age         52
shoesize    46
Name: Reuven, dtype: int64

In [173]:
df.loc[['Reuven', 'Amotz']]

        age  shoesize
name
Reuven   52        46
Amotz    17        44

In [174]:
# what about the reverse -- can we take an index and make it a regular column again?
# we use reset_index

df.reset_index()

     name  age  shoesize
0  Reuven   52        46
1   Atara   22        40
2  Shikma   20        40
3   Amotz   17        44

In [175]:
# once again, if I want to change df, I have to assign the result of reset_index to it

df = df.reset_index()
df

     name  age  shoesize
0  Reuven   52        46
1   Atara   22        40
2  Shikma   20        40
3   Amotz   17        44

In [176]:
df = DataFrame([[11, 15],
                [10, 22],
                [14, 23],
                [12, 18],
                [12, 14],
                [11, 17],
                [12, 19],
                [12, 18],
                 [12, 19],
                [10, 18]],
              columns=['low', 'high'],
              index='Wed Thu Fri Sat Sun Mon Tue Wed Thu Fri'.split())
df

     low  high
Wed   11    15
Thu   10    22
Fri   14    23
Sat   12    18
Sun   12    14
Mon   11    17
Tue   12    19
Wed   12    18
Thu   12    19
Fri   10    18

In [177]:
# in this data frame, we created it with an index of strings
# let's reset the index

df.reset_index()

  index  low  high
0   Wed   11    15
1   Thu   10    22
2   Fri   14    23
3   Sat   12    18
4   Sun   12    14
5   Mon   11    17
6   Tue   12    19
7   Wed   12    18
8   Thu   12    19
9   Fri   10    18

# Boolean series, mask indexes, and data frames

Remember:
- If I apply a conditional to a series, I get back a boolean series
- If I apply a boolean series to a series, this is known as a "mask index," only letting through those values that were `True`

Thus:
- I can create a boolean series from *any* column
- I can apply it to *any* column
- I can even apply it to the entire data frame

In [178]:
df

     low  high
Wed   11    15
Thu   10    22
Fri   14    23
Sat   12    18
Sun   12    14
Mon   11    17
Tue   12    19
Wed   12    18
Thu   12    19
Fri   10    18

In [179]:
# apply a conditional, via broadcast, to a series -- this will give me a boolean series back
df['low'] < 12

Wed     True
Thu     True
Fri    False
Sat    False
Sun    False
Mon     True
Tue    False
Wed    False
Thu    False
Fri     True
Name: low, dtype: bool

In [180]:
# I can apply this boolean series back to df['low'], getting those elements <12

# series  mask index, via a boolean series
df['low'][df['low'] < 12]

Wed    11
Thu    10
Mon    11
Fri    10
Name: low, dtype: int64

In [181]:
# what is the high temperature going to be
# on days when the low temperature is < 12?

df['high'][df['low'] < 12]

Wed    15
Thu    22
Mon    17
Fri    18
Name: high, dtype: int64

In [183]:
# we can apply the mask index to the *entire* data frame

# this returns rows where the condition is True

df[df['low']<12]   # show me all rows in df where the low temp < 12

     low  high
Wed   11    15
Thu   10    22
Mon   11    17
Fri   10    18

# Some other examples of what we can query in this way

- Show all log entries where the user ID < 500 (i.e., administrative user)
- Show all customers who bought > 1,000 dollars of products in the last month
- Get all parking tickets for red cars

# Exercise: Family queries

1. Set the index on your family data frame to use the name.
2. Find all rows where the shoe size is less than the average.
3. Find the mean shoe size for people with above-average ages.

In [184]:
df = DataFrame([
    ['Reuven', 52, 46],
    ['Atara', 22, 40],
    ['Shikma', 20, 40],
    ['Amotz', 17, 44]
    ],
  columns='name age shoesize'.split())
df

     name  age  shoesize
0  Reuven   52        46
1   Atara   22        40
2  Shikma   20        40
3   Amotz   17        44

In [185]:
df = df.set_index('name')
df

        age  shoesize
name
Reuven   52        46
Atara    22        40
Shikma   20        40
Amotz    17        44

In [186]:
df['name']   # what are the values in the "name" column

KeyError: 'name'

In [187]:
df.index   # retrieve the index

Index(['Reuven', 'Atara', 'Shikma', 'Amotz'], dtype='object', name='name')

In [188]:
df.columns   # retrieve the list of columns

Index(['age', 'shoesize'], dtype='object')

In [189]:
df

        age  shoesize
name
Reuven   52        46
Atara    22        40
Shikma   20        40
Amotz    17        44

In [192]:
# Find all rows where the shoe size is less than the average.

df[  df['shoesize'] < df['shoesize'].mean()  ]

        age  shoesize
name
Atara    22        40
Shikma   20        40

In [195]:
# Find the mean shoe size for people with above-average ages.

df[   df['age'] > df['age'].mean()   ].mean()

age         52.0
shoesize    46.0
dtype: float64

In [196]:
# when we invoke .loc, we can pass it either 
# - 1 argument, selecting our rows
# - 2 arguments, selecting rows + columns

df.loc[

   df['age'] > df['age'].mean()    # row selector
    ,
   'shoesize'                      # column selector
      ]

name
Reuven    46
Name: shoesize, dtype: int64

# Next up

- `.loc` and the various types of row + column selectors we can use
- CSV data -- reading it and starting to play with it

In [197]:
df

        age  shoesize
name
Reuven   52        46
Atara    22        40
Shikma   20        40
Amotz    17        44

In [201]:
# apply the boolean series as a mask index to the shoesize column
df['shoesize'][df['age'] > df['age'].mean()]

name
Reuven    46
Name: shoesize, dtype: int64

In [200]:
# here, I'm using the 2-argument version of .loc

df.loc[

   df['age'] > df['age'].mean()    # row selector
    ,
   'shoesize'                      # column selector
      ]

name
Reuven    46
Name: shoesize, dtype: int64

# Rule of thumb: Avoid `][` brackets

As a general rule, whenever you use two sets of square brackets next to one another:

    df['a']['b']
    
You're asking Pandas to do extra work, because you're first retrieving `df['a']` and then you're asking it to retrieve `['b']` on the returned value.

You don't know if Pandas is really giving you the original `df['a']` or a copy that it made for its own internal purposes.

This is *especially* true when you're assigning to values in a data frame.

Whenever you see two sets of square brackets next to each other, with one ending `]` and the next starting `[`, you should try to find an alternative. It might work a lot of the time, but when it doesn't, it'll really hurt.

# `.loc`, row selectors, and column selectors

If you want to retrieve from a data frame, your most flexible and dependable way to do so is with `.loc`:

- The first argument is a row selector
    - an index
    - a list of indexes
    - a boolean series for use as a mask index
- The second argument (which is optional) is a column selector
    - a column name
    - a list of column names
    - a boolean series for retrieving columns **WHICH IS HARD TO READ**

In [202]:
df

        age  shoesize
name
Reuven   52        46
Atara    22        40
Shikma   20        40
Amotz    17        44

In [207]:
df = DataFrame([[11, 15],
                [10, 22],
                [14, 23],
                [12, 18],
                [12, 14],
                [11, 17],
                [12, 19],
                [12, 18],
                 [12, 19],
                [10, 18]],
              columns=['low', 'high'],
              index='15 16 17 18 19 20 21 22 24 25'.split())

df['diff'] = df['high'] = df['low']

In [208]:
df

    low  high  diff
15   11    11    11
16   10    10    10
17   14    14    14
18   12    12    12
19   12    12    12
20   11    11    11
21   12    12    12
22   12    12    12
24   12    12    12
25   10    10    10

In [209]:
# show me data where the low temperature will be < 12

df['low'] < 12

15     True
16     True
17    False
18    False
19    False
20     True
21    False
22    False
24    False
25     True
Name: low, dtype: bool

In [210]:
# let's take that boolean series and apply it, via .loc, to the entire data frame

df.loc[
    df['low'] < 12      # row selector
]

    low  high  diff
15   11    11    11
16   10    10    10
20   11    11    11
25   10    10    10

In [211]:
# what if I want to find the high temperature 
# on days when the low is < 12?

# this means: show me high temperatures
# on days when the low is < 12

df.loc[
    df['low'] < 12      # row selector
    ,
    'high'              # column selector
]

15    11
16    10
20    11
25    10
Name: high, dtype: int64

In [212]:
# show me high temps on days when the low is below average

df.loc[
    df['low'] < df['low'].mean()      # row selector
    ,
    'high'              # column selector
]

15    11
16    10
20    11
25    10
Name: high, dtype: int64

In [213]:
# show me high temps + diffs on days when the low is below average

df.loc[
    df['low'] < df['low'].mean()      # row selector
    ,
    ['high', 'diff']              # column selector
]

    high  diff
15    11    11
16    10    10
20    11    11
25    10    10

In [216]:
# show me the high temps and diffs in the next five days

# I could use head, but I'm going to use .loc instead

df.loc[
    '15':'19'       # row selector -- a slice of the index, from 15-19
    ,
    ['high', 'diff']  # these two columns
]

    high  diff
15    11    11
16    10    10
17    14    14
18    12    12
19    12    12

# Exercise: Countries

1. Create a data frame with five rows, representing five countries. 
2. From Wikipedia, get the area and population of those five countries.
3. Create a data frame in which the country names are the indexes, and the two columns are `area` and `population`.
4. Find the population of countries with above-average area.
5. Get descriptive statistics for both population and area for the first three countries in the data frame.

In [218]:
df = DataFrame([
    ['China', 1411750000, 9596961],
    ['India', 1388163000, 3287263],
    ['United States', 334489765, 3796742],
    ['Indonesia', 275773800, 1904569],
    ['Pakistan', 235825000, 881913]
    ],
    columns=['country', 'population', 'area']
)

In [219]:
df

         country  population     area
0          China  1411750000  9596961
1          India  1388163000  3287263
2  United States   334489765  3796742
3      Indonesia   275773800  1904569
4       Pakistan   235825000   881913

In [220]:
df = df.set_index('country')

In [221]:
df

               population     area
country
China          1411750000  9596961
India          1388163000  3287263
United States   334489765  3796742
Indonesia       275773800  1904569
Pakistan        235825000   881913

In [222]:
df.dtypes

population    int64
area          int64
dtype: object

In [224]:
df['area'] < df['area'].mean()

country
China            False
India             True
United States     True
Indonesia         True
Pakistan          True
Name: area, dtype: bool

In [226]:
df.loc[
    df['area'] < df['area'].mean()   # row selector
    ,
    'population'     # column selector
]

country
India            1388163000
United States     334489765
Indonesia         275773800
Pakistan          235825000
Name: population, dtype: int64

In [228]:
# what is the area of countries with above-average population in our data set?

df.loc[
    df['population'] > df['population'].mean()   # row selector
    ,
    'area' # column selector
    
]

country
China    9596961
India    3287263
Name: area, dtype: int64

In [229]:
df

               population     area
country
China          1411750000  9596961
India          1388163000  3287263
United States   334489765  3796742
Indonesia       275773800  1904569
Pakistan        235825000   881913

In [230]:
df.loc[
    ['China', 'India', 'United States']    # row selector
    ,
    ['population', 'area']    # column selector
]

               population     area
country
China          1411750000  9596961
India          1388163000  3287263
United States   334489765  3796742

In [233]:
df.loc[
    ['China', 'India', 'United States']    # row selector
    ,
    ['population', 'area']    # column selector
].describe()

         population          area
count  3.000000e+00  3.000000e+00
mean   1.044801e+09  5.560322e+06
std    6.152605e+08  3.505101e+06
min    3.344898e+08  3.287263e+06
25%    8.613264e+08  3.542002e+06
50%    1.388163e+09  3.796742e+06
75%    1.399956e+09  6.696852e+06
max    1.411750e+09  9.596961e+06

# CSV files

A lot of data is stored (and transmitted) using CSV format.

This stands for "comma-separated values" (or sometimes, "character-separated values").

The idea is:

- Every line in the file represents one record, which should become one row in our data frame
- The fields on each row are separated by commas (or another character)
- Typically, the first line of the file is not data, but rather column names that we want to use

To create a data frame from a CSV file, we use the `pd.read_csv` function. We hand it a filename, and it returns a data frame.

In [234]:
filename = 'taxi.csv'

df = pd.read_csv(filename)
df.head()

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,2,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,-73.954430,40.764141,1,N,-73.974754,40.754093,2,17.0,0.0,0.5,0.00,0.0,0.3,17.80
1,2,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,-73.971443,40.758942,1,N,-73.978539,40.761909,1,6.5,0.0,0.5,1.00,0.0,0.3,8.30
2,2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,-73.978111,40.738434,1,N,-73.990273,40.745438,1,8.0,0.0,0.5,2.20,0.0,0.3,11.00
3,2,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,-73.945892,40.773529,1,N,-73.971527,40.760330,1,13.5,0.0,0.5,2.86,0.0,0.3,17.16
4,1,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,-73.979088,40.776772,1,N,-73.982162,40.758999,2,9.5,0.0,0.5,0.00,0.0,0.3,10.30

# `taxi.csv`

This file contains 10,000 taxi rides in New York City that took place in 2015. You can download any/all taxi rides from the last 10 years or so from the NYC government.

In [236]:
# how big is this data frame? We can check with the "shape" attribute

df.shape   # number of rows, number of columns

(9999, 19)

In [237]:
# maybe I don't want *all* of the columns. Maybe I want just a few of them, to save memory
# and increase efficiency.

# I can pass the "usecols" argument to read_csv, passing a list of columns I want

df = pd.read_csv(filename,
                usecols=['passenger_count', 'trip_distance', 'total_amount'])

In [238]:
df

      passenger_count  trip_distance  total_amount
0                   1           1.63         17.80
1                   1           0.46          8.30
2                   1           0.87         11.00
3                   1           2.13         17.16
4                   1           1.40         10.30
...               ...            ...           ...
9994                1           2.70         12.30
9995                1           4.50         20.30
9996                1           5.59         22.30
9997                6           1.54          7.80
9998                1           5.80         26.75

[9999 rows x 3 columns]

In [239]:
# what was the average trip distance for passengers in our data set?

df['trip_distance'].mean()

3.1585108510851083

In [240]:
# what was the average total amount paid by passengers in our data set?

df['total_amount'].mean()

17.552472247224728

In [241]:
# what were the average trip distance and total amount in our data set?

df[['trip_distance', 'total_amount']].mean()

trip_distance     3.158511
total_amount     17.552472
dtype: float64

In [245]:
# what was the average trip distance for 2-passenger trips?

# I'm going to need to use a boolean series, finding 2-person trips

df.loc[
    df['passenger_count'] == 2    # row selector
    ,
    'trip_distance'               # column selector
].mean()

3.3843869002284848

In [246]:
# what about average trip distance + total amount for 2 passengers?

df.loc[
    df['passenger_count'] == 2    # row selector
    ,
    ['trip_distance', 'total_amount']          # column selector
].mean()

trip_distance     3.384387
total_amount     18.406306
dtype: float64